#### Backend Terraform Plan (dev) 📖
<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.app_ecr.aws_ecr_lifecycle_policy.this will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Remove untagged images after 1 days"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep only 30 tagged images"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep only 30 images with any tag"
                      + rulePriority = 3
                      + selection    = {
                          + countNumber = 60
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "lifestyle-app-dev"
    }

  # module.app_ecr.aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "lifestyle-app-dev"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Module"      = "ecr"
          + "Repository"  = "lifestyle-app"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Module"      = "ecr"
          + "Repository"  = "lifestyle-app"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.app_ecr.aws_ecr_repository_policy.this will be created
  + resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:ListImages",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeImages",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::070561229936:root"
                        }
                      + Sid       = "AllowPull"
                    },
                  + {
                      + Action    = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:CompleteLayerUpload",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::070561229936:root"
                        }
                      + Sid       = "AllowPush"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "lifestyle-app-dev"
    }

  # module.main_table.data.aws_iam_policy_document.table_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "table_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:ConditionCheckItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:GetItem",
              + "dynamodb:PartiQLDelete",
              + "dynamodb:PartiQLInsert",
              + "dynamodb:PartiQLSelect",
              + "dynamodb:PartiQLUpdate",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.main_table.aws_dynamodb_table.this will be created
  + resource "aws_dynamodb_table" "this" {
      + arn                         = (known after apply)
      + billing_mode                = "PAY_PER_REQUEST"
      + deletion_protection_enabled = false
      + hash_key                    = "pk"
      + id                          = (known after apply)
      + name                        = "main-dev"
      + range_key                   = "sk"
      + read_capacity               = (known after apply)
      + stream_arn                  = (known after apply)
      + stream_enabled              = false
      + stream_label                = (known after apply)
      + stream_view_type            = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Module"      = "dynamodb"
          + "Table"       = "main"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Module"      = "dynamodb"
          + "Repository"  = "john-matlock-eng/ai-lifestyle-app"
          + "Table"       = "main"
        }
      + write_capacity              = (known after apply)

      + attribute {
          + name = "pk"
          + type = "S"
        }
      + attribute {
          + name = "sk"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }

      + ttl (known after apply)
    }

  # module.main_table.aws_iam_policy.table_access will be created
  + resource "aws_iam_policy" "table_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Access policy for main-dev DynamoDB table"
      + id               = (known after apply)
      + name             = "main-dev-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Module"      = "dynamodb"
          + "Table"       = "main"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Module"      = "dynamodb"
          + "Repository"  = "john-matlock-eng/ai-lifestyle-app"
          + "Table"       = "main"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + dynamodb_access_policy_arn = (known after apply)
  + dynamodb_table_name        = "main-dev"
  + ecr_repository_name        = "lifestyle-app-dev"
  + ecr_repository_url         = (known after apply)
```

</details>

*Environment*: `dev`
*Triggered by*: @john-matlock-eng
*Action*: `pull_request`

**Note**: This plan will be automatically applied to the **dev** environment.